#       Dataframe is 2-dimensional labled data structure
            # A Dataframe compries of Row & coumn

In [1]:
import numpy as np
import pandas as pd

In [2]:
d1=pd.DataFrame({"Name":["Lovely","Sandeep","preet", "harjas"], "Age":[26,29,23,3]}, index=('a', 'b','c','d'))

In [3]:
print(d1)

      Name  Age
a   Lovely   26
b  Sandeep   29
c    preet   23
d   harjas    3

In [4]:
d1.shape

(4, 2)

In [5]:
d1.dtypes

Name    object
Age      int64
dtype: object

In [6]:
d1.head(2)

      Name  Age
a   Lovely   26
b  Sandeep   29

In [7]:
d1.tail(3)

      Name  Age
b  Sandeep   29
c    preet   23
d   harjas    3

In [8]:
d1.describe()

             Age
count   4.000000
mean   20.250000
std    11.757976
min     3.000000
25%    18.000000
50%    24.500000
75%    26.750000
max    29.000000

In [9]:
d1=pd.DataFrame({"Name":["Lovely","Sandeep","preet", "harjas"], "Age":[26,29,23,3]}, index=('a', 'b','c','d'))

In [10]:
data

      Name  Age
a   Lovely   26
b  Sandeep   29
c    preet   23
d   harjas    3

In [11]:
d1.mean()

Age    20.25
dtype: float64

In [12]:
d1.mode()

      Name  Age
0   Lovely    3
1  Sandeep   23
2   harjas   26
3    preet   29

In [13]:
d1.median()

Age    24.5
dtype: float64

In [14]:
d1.min()

Name    Lovely
Age          3
dtype: object

In [15]:
d1.max()

Name    preet
Age        29
dtype: object

In [16]:
def half(s):
    return s*0.5
d1["Age"].apply(half)

a    13.0
b    14.5
c    11.5
d     1.5
Name: Age, dtype: float64

In [17]:
def fourth(s):
    return s*2
d1["Age"].apply(fourth)

a    52
b    58
c    46
d     6
Name: Age, dtype: int64

In [21]:
ipl= df.grade.astype(int)

NameError: name 'Name' is not defined